{
  "background": {
    "en": "I specialize in backend architecture and performance optimization, with expertise in API design, multi-threading, advanced database indexing, and high-concurrency cache strategies using Redis and Lua scripts. My experience includes fixing N+1 queries, managing multi-source connection pools, and implementing distributed locks to ensure data consistency under heavy load. I am also proficient in orchestrating containerized deployments using Docker, Kubernetes, and CI/CD pipelines. Additionally, I have experience designing and optimizing LLM pipelines (e.g., RetrievalQAChain) to achieve low-latency, high-accuracy responses.\n\nMy personal website contains a complete skill map — feel free to reach out via email, and I will respond promptly.\n\nhttps://peoplesystem.tatdvsonorth.com/tymultiverse/about",
    "zh": "我專精於後端架構與效能優化，具備 API 設計、多執行緒、進階資料庫索引與高併發快取策略（使用 Redis 與 Lua 腳本）的專業能力。經驗涵蓋修復 N+1 查詢問題、管理多源連線池，以及實作分布式鎖以確保高負載下的資料一致性以及使用 Docker、Kubernetes 與 CI/CD 管道協調容器化部署。亦擅長設計與優化 LLM 管道（如 RetrievalQAChain）以實現低延遲、高準確度的回應，\n\n我的個人網站包含完整的技能圖譜 — 歡迎來信交流，我會盡快回覆。\n\nhttps://peoplesystem.tatdvsonorth.com/tymultiverse/about"
  },
  "experience": [
    {
      "title": "Open Source Backend Engineer",
      "company": "Mercuries Life Insurance",
      "period": "2024/3~Present",
      "projectExperience": {
        "en": [
          "SSO System Architecture & Integration: Designed and implemented enterprise SSO solutions using Keycloak and RedHat SSO for secure authentication",
          "Java Ecosystem Modernization: Led comprehensive upgrade of JBoss, MVC, and Spring/Spring Boot applications from Java 8/11 to Java 17",
          "DevOps & Containerization: Implemented Linux offline deployment strategies and containerized applications using Kubernetes and Docker Compose",
          "Upgraded RHEL from 7 to 8 for 20+ servers",
          "API Development & Integration: Built WebSocket and RESTful APIs for seamless frontend-backend communication",
          "Quality Assurance & Observability: Developed comprehensive unit testing framework (JUnit5, Mockito) and implemented monitoring dashboards using Grafana and Prometheus"
        ],
        "zh": [
          "SSO 系統架構與整合：使用 Keycloak 與 RedHat SSO 設計並實作企業級 SSO 解決方案，確保安全驗證",
          "Java 生態系現代化：主導將 JBoss、MVC 與 Spring/Spring Boot 應用從 Java 8/11 升級至 Java 17",
          "DevOps 與容器化：實作 Linux 離線部署策略，並使用 Kubernetes 與 Docker Compose 將應用容器化",
          "為 20+ 台伺服器將 RHEL 從 7 升級至 8",
          "API 開發與整合：打造 WebSocket 與 RESTful API，以實現前後端無縫溝通",
          "品質保證與可觀測性：建立完善的單元測試框架（JUnit5、Mockito），並使用 Grafana 與 Prometheus 部署監控儀表板"
        ]
      }
    },
    {
      "title": "Macro Associate",
      "company": "Tarobo Investment Advisors",
      "period": "2022/9~2023/1",
      
      "projectExperience": {
        "en": [
          "Built automated reporting workflows; integrated SinoPac Shioaji trading API with Python to ingest market data and prototype trading strategies",
          "Delivered daily market intelligence reports covering emerging markets (Mexico, India, Brazil) with real-time analysis",
          "Analyzed macroeconomic indicators including container shipping trends, US retail sales, TWD currency flows, foreign exchange dynamics, and EPFR fund flows for cross-asset allocation strategies",
          "Maintained and enhanced data infrastructure across 10+ databases for comprehensive market analysis"
        ],
        "zh": [
          "接觸自動化報表；使用 Python 串接永豐金交易 API（Shioaji），並撰寫策略原型",
          "每日提供涵蓋新興市場（墨西哥、印度、巴西）的市場情報報告，並進行即時分析",
          "分析宏觀經濟指標，包括貨櫃航運趨勢、美國零售銷售、台幣資金流向、外匯動態與 EPFR 基金流向，以制定跨資產配置策略",
          "維護並強化橫跨 10+ 個資料庫的數據基礎設施，以支援全面的市場分析"
        ]
      }
    },
    {
      "title": "Fintech PM, MA Program",
      "company": "Far Eastern Int'l Bank",
      "period": "2021/8~2022/5",
      
      "projectExperience": {
        "en": [
          "Built Power BI dashboards for executive and product (Bankee) KPIs; designed data models and visuals to support business reviews",
          "Developed 20+ business plan drafts and successfully proposed 2 digital payment projects in collaboration with major telecommunications companies",
          "Conducted comprehensive research on emerging fintech trends including BNPL, cryptocurrency, and online microloan product design with weekly reporting",
          "Managed 31 operational procedures for the digital payment department ensuring compliance and efficiency",
          "Created cross-industry alliance strategies with 3 proposals approved through internal review processes, resulting in 2 successful implementations"
        ],
        "zh": [
          "使用 Power BI 建置視覺化儀表板，設計資料模型與圖表以支援主管與產品 KPI 檢視",
          "撰寫 20+ 份商業計畫書，並與大型電信公司合作成功提出 2 個數位支付專案",
          "進行 BNPL、加密貨幣與線上小額信貸產品設計等新興金融科技趨勢研究，並每週提交報告",
          "管理數位支付部門 31 項作業流程，確保合規與效率",
          "提出跨產業聯盟策略，3 項提案通過內部審查，其中 2 項成功落地"
        ]
      }
    },
    {
      "title": "Auditor",
      "company": "EY",
      "period": "2019/9~2020/3",
      
      "projectExperience": {
        "en": [
          "Automated reconciliation workflow using Excel VBA to accelerate audit working papers",
          "Conducted comprehensive financial statement audits covering Current Assets, Fixed Assets, Liabilities, and Equity for 20+ client engagements",
          "Coordinated audit procedures across 8 specialized teams for financial services clients including equity funds and bond funds",
          "Performed 40+ substantive analytical procedures to validate account variations and identify potential discrepancies",
          "Developed sensitivity analyses for interest rate and foreign currency exposures, along with Top 10 Suppliers/Customers concentration analysis",
          "Audited and analyzed 20+ Balance Sheets/Income Statements and 3+ Cash Flow Statements"
        ],
        "zh": [
          "使用 Excel VBA 自動化鉤稽流程，加速稽核底稿作業",
          "為 20+ 客戶專案執行財務報表稽核，範圍涵蓋流動資產、固定資產、負債及權益",
          "協調 8 個專業團隊執行金融服務客戶（含股票與債券基金）的稽核程序",
          "執行 40+ 次實質性分析程序，以驗證科目變動並識別潛在差異",
          "編制利率與外幣曝險敏感度分析，及前十大供應商／客戶集中度分析",
          "稽核並分析 20+ 份資產負債表／損益表及 3+ 份現金流量表"
        ]
      }
    }
  ],
  "education": [
    {
      "institution": "RedHat",
      "period": "2024/12",
      "programs": [
        "Red Hat JBoss Application Administration I (AD248)"
      ]
    },
    {
      "institution": "iSpan",
      "period": "2023/10~2024/2",
      "programs": [
        "JavaEE Career Development Program"
      ]
    },
    {
      "institution": "FreeCodeCamp.com",
      "period": "2023/7~2023/9",
      "programs": [
        "JavaScript Algorithms and Data Structures",
        "Data Visualization"
      ]
    },
    {
      "institution": "Hong Kong Polytechnic University",
      "period": "2020/9~2021/9",
      "programs": [
        "Master of Finance in Investment Management"
      ]
    },
    {
      "institution": "Fu Jen Catholic University",
      "period": "2013/9-2018/6",
      "programs": [
        "B.B.A. in Finance and International Business"
      ]
    },
    {
      "institution": "Temple University",
      "period": "2016/8-2017/5",
      "programs": [
        "Global Exchange Program"
      ]
    }
  ]
}
