{
    "quadrant1": {
        "title": {
            "en": "First Principles",
            "zh": "第一性原理"
        },
        "content": {
            "en": "I treat systems like a chessboard. Instead of rushing to code, I first map out the structure of the problem. Where others see bugs, latency, or compatibility errors, I see the edges of a puzzle waiting to be solved. My instinct is not to patch, but to design a path that ensures long-term stability. When I ask questions like 'What is the essence of this process?' or 'Why does this feel counterintuitive?', I'm not looking for shortcuts—I’m uncovering the principles beneath the surface.",
            "zh": "我習慣把系統當成一盤棋，不是急著寫程式，而是先把問題的結構攤開來。\n\n當別人看到的是 Bug、延遲或相容性錯誤，我看到的卻是謎題的邊界，等待被拆解。我的直覺不是去打補丁，而是去設計一條能長期支撐的解法路徑。\n\n當我問「這個 process 的本質是什麼？」或「為什麼這樣算起來不直覺？」時，其實我不是在找捷徑，而是在挖出背後的底層規律。"
        },
        "extension": {
            "en": "This way of thinking shaped how I worked with Kubernetes.\n\nAt first, I took the quick route—exposing all nodes to the public internet. It worked, but it was fragile. Later, I reframed the question: instead of asking 'How do I keep containers alive?', I asked 'What boundaries should protect the cluster itself?'. That shift led me to redesign the setup with private nodes and Batison operators, giving the workloads stronger isolation and governance.\n\nThe same mindset guided me when new nodes came with restrictive CPU limits. Rather than just tweaking quotas, I restructured the flow by introducing RabbitMQ. This offloaded spikes, smoothed throughput, and turned what seemed like a scaling problem into an opportunity to upgrade the architecture.",
            "zh": "這種思維影響了我在 Kubernetes 上的轉折。第一次上 K8s，我走了最簡單的路：把 node 公網全開，雖然能跑，但風險極高。後來我換個角度思考：問題不是『容器怎麼不要掛掉』，而是『整個 cluster 應該自己劃出什麼邊界？』。於是我改用 private node，並透過 operator 自動化治理與隔離，讓整個架構不只是能跑，而是具備韌性。\n\n同樣的思維也發生在 RabbitMQ 的經驗裡。當新節點 CPU 被限得太緊，服務一遇到尖峰流量就會窒息。一般的做法可能是調 quota 或加硬體，但我退一步問：真正的問題不是『怎麼撐住這顆 node？』，而是『能不能把需求本身的流動方式重塑？』。導入 RabbitMQ 後，它成為緩衝與分派層，把生產者與消費者解耦，讓尖峰流量被平滑化，系統自然而然具備彈性。"
        }
    },
    "quadrant2": {
        "title": {
            "en": "Foundations That Led Here",
            "zh": "前山伏筆"
        },
        "content": {
            "en": "EY Auditor: VBA macros revealed passion for redesigning processes. Far Eastern Bank Fintech PM (2021-2022): RPA automation showed me code's power to save hundreds of hours. From that moment, I knew engineering was my path. Tarobo Investment Macro Associate (2022-2023): Daily Python coding for trading strategies became more engaging than research. In small coding experiments, I felt passion turning logic into running systems. This contrast pushed me to career transition. Not because finance was bad, but because I wanted 'creation' rather than 'documentation'. Every successful debug proved my choice was right.",
            "zh": "EY 審計：VBA 巨集讓我發現熱衷於改造流程。\n\n遠東商銀 Fintech PM（2021-2022）：RPA 自動化展現程式碼節省百小時的威力，從那一刻我決定成為工程師。\n\nTarobo投資 Macro Associate（2022-2023）：每天寫 Python 處理交易策略，比研究報告更投入。\n\n在程式實驗中，我感受到將邏輯轉成系統的熱情。這種創造與記錄的差異推動我轉職。每個成功的 Debug 都證明我的選擇正確。"
        },
        "extension": {
            "en": "EY: I automated reconciliations with VBA, not to save hours for its own sake, but because I was drawn to the elegance of redesigning processes. Far Eastern Bank: building RPA bots for 31 workflows and prototyping BNPL taught me how code could turn repetitive operations into scalable systems. I even designed a B2B2C model where Bankee served as the entry point and a cryptocurrency exchange provided KYC onboarding—a thought experiment in mapping transaction events into auditable logs. Tarobo: integrating Shioaji tick data and automating backtests wasn't about chasing alpha alone, but about seeing how logic could self-execute as living systems. These projects deepened the contrast: finance prized documentation, while I craved creation. That's why I pursued JavaScript and JavaEE training, built Django apps, set up Jenkins pipelines, and containerized workloads with Docker. Toastmasters shaped another layer: the ability to transform abstract principles into vivid, shareable narratives. Together, these experiences formed the foundation: every script, prototype, and debug reinforced my shift from documenting reality to building it.",
            "zh": "EY：我用 VBA 自動化對帳，不只是為了省工時，而是被流程重構的優雅吸引。遠東商銀：開發 31 個流程的 RPA 機器人、設計 BNPL 原型，讓我體會到程式能把重複作業變成可規模化的系統。我設計了一個 B2B2C 模型：Bankee 作為入口，引導使用者到虛擬貨幣交易所完成 KYC 開戶——這其實是一個流程事件建模的演練，著重在思考每個交易進出如何串起整個場景。Tarobo：串接 Shioaji 逐筆行情、建立自動回測流程，重點不是追求超額報酬，而是看到邏輯能自動化執行，像活的系統一樣。金融強調紀錄，而我渴望創造。於是我進修 JavaScript 與 JavaEE，嘗試 Django 專案、Jenkins 流水線、Docker 部署。Toastmasters 又提供另一層養分：把抽象原則轉成可分享的故事。所有這些經歷，構成了我的基礎：每一段程式碼、原型與 debug 都強化了我的選擇——從紀錄現實，走向建構現實。"
        }
    },
    "quadrant3": {
        "title": {
            "en": "Battlefield",
            "zh": "實戰場"
        },
        "content": {
            "en": "Core: Spring Boot microservices, REST controllers, security filters. Django ASGI/ORM/REST. Celery async LLM retrieval. Docker/K8s for microservices. Redis distributed locks; RabbitMQ for async processing; PostgreSQL composite + GIN indexes, 5× retrieval boost. Algorithms: weekly LeetCode drills – Binary Trees, DP, Backtracking, Sliding Window.",
            "zh": "核心：Spring Boot 微服務、REST 控制器、安全過濾器。 Django ASGI/ORM/REST。 Celery 非同步 LLM 檢索。 Docker/K8s 微服務。 Redis 分布式鎖；RabbitMQ 非同步處理；PostgreSQL 使用複合索引 + GIN 索引後，針對模糊檢索與多欄位查詢的效能，相較於原本單索引方案提升約 5 倍。 演算法：每週 LeetCode 訓練 – 二元樹、DP、回溯、滑動視窗。"
        },
        "extension": {
            "en": "API Gateway: rewrote JOIN queries, added composite indexes, built caching layers. Retrieval systems: pg_trgm + pgvector hybrid, GIN + IVFFlat indexes, fallback logic to reduce hallucinations, provider rate-limiting. Infrastructure: containerized with Docker, K8s autoscaling, Terraform networking on OCI with VCN/Bastion/OKE. CI/CD: Jenkins pipelines. Reliability: Redis session management, WebSocket STOMP push, chain-of-responsibility for exceptions, JUnit5/Mockito coverage. Data: HikariCP tuning, ORM N+1 fix, batched queries reducing GC churn. Spring Boot: mastered layered architecture, Spring Security JWT filters, async @Scheduled tasks, optimized RestTemplate/WebClient. Algorithms: solved 200+ LeetCode problems focusing on production applications – Binary Trees for caching/indexing, DP for job scheduling, Backtracking for search optimizations.",
            "zh": "API Gateway：重寫 JOIN，加複合索引，建快取層。檢索系統：pg_trgm + pgvector 混合，GIN + IVFFlat 索引，fallback 策略降幻覺，API 呼叫限流。基礎設施：Docker 容器化，K8s 自動擴展，OCI Terraform 建 VCN/Bastion/OKE。CI/CD：Jenkins pipeline。可靠性：Redis 管理 session，WebSocket STOMP 推播，責任鏈處理例外，JUnit5/Mockito 測試覆蓋。資料：HikariCP 多資料源調優，修 ORM N+1，批次查詢降 GC。Spring Boot：熟練分層架構、Spring Security JWT 過濾器、非同步 @Scheduled 任務、RestTemplate/WebClient 優化。演算法：已解 200+ LeetCode 題目，專注生產應用 – 二元樹用於快取/索引，DP 用於任務排程，回溯用於搜尋優化。"
        }
    },
    "quadrant4": {
        "title": {
            "en": "Next Iteration",
            "zh": "下個迴圈"
        },
        "content": {
            "en": "Focus: high-concurrency architecture, asynchronous pipelines, distributed data systems, guided by DDIA. Product: build data-intensive flows that integrate AI modules, turn prototypes into user-facing MVPs. AI: generative models, prompt engineering, retrieval-augmented pipelines, embedding stores. Inspiration: Modular-style toolchains, assembling best-of-breed systems.",
            "zh": "核心關注：高併發架構、非阻塞非同步管線與分散式資料系統設計，實作過程以《Designing Data-Intensive Applications》為方法論依據。 產品：設計能整合 AI 模組的資料流，將原型轉化為用戶可用的 MVP。 AI：生成式模型、提示工程、RAG 管線、embedding 儲存。 借鏡：像 Modular 一樣組合最優工具鏈，打造最佳系統。"
        },
        "extension": {
            "en": "Forward roadmap: concurrency – refine Java CompletableFuture pools, explore Project Loom virtual threads, optimize non-blocking I/O with WebFlux and Netty; queues – benchmark RabbitMQ for throughput vs durability, backpressure handling, dead-letter strategies; database – incremental materialized views, sharding experiments, adaptive query caching; pipelines – batch embedding updates, retrieval accuracy tuning with hybrid pgvector + ANN, consistency checks across shards; AI – LLM-based doc routing, cost-aware tokenization, multi-provider orchestration, evaluation harness for accuracy/latency/cost tradeoffs; product – systematize side projects into MVPs, create feedback instrumentation, run A/B feature toggles, refine onboarding flows; team – knowledge base from Toastmasters, peer review rituals, ownership rotation. Guiding star: DDIA principles applied to AI systems – immutability, streaming-first, fault-tolerance, scalability, traceability – each new iteration strengthens data flow resilience while keeping product usable.",
            "zh": "前瞻路線：併發 – 精練 Java CompletableFuture 線程池，探索 Project Loom 虛擬線程，用 WebFlux/Netty 做非阻塞 I/O；佇列 – RabbitMQ 測試耐久與吞吐，設計 backpressure 機制與死信佇列；資料庫 – 增量物化檢視、分片實驗、自適應查詢快取；資料流 – 分片設計，探索如何將大資料集分散到多個節點處理；AI – 文件路由、token 成本控制、多模型協作，建立準確率/延遲/成本評估框架；產品 – 把 side project 系統化成 MVP，內建回饋監測，執行 A/B 測試，優化 onboarding 流程；團隊 – 借助 Toastmasters 訓練形成知識庫，建立 PR review 儀式，模組輪值。 指北星：以《DDIA》原則導入 AI 系統 – 不可變性、串流優先、容錯、可擴展、可追蹤，每次迭代都讓資料流更韌性，同時保證產品可用。"
        }
    }
}