{
    "quadrant1": {
        "title": {
            "en": "Deliberate Practice",
            "zh": "刻意練習"
        },
        "content": {
            "en": "I treat development as a puzzle game; every bug and bottleneck is a challenge. Document Management System: built multi-layered Spring Boot application with comprehensive backend features; designed dual PostgreSQL data sources with HikariCP connection pools; latency optimized through composite indexes and N+1 query fixes. Customer Portal Q&A System: developed FastAPI-based QA system with LangChain integration; implemented multi-character personality-based RAG chatbots with hybrid retrieval pipelines. Use AI tools, debugging as deliberate growth.",
            "zh": "我把開發當成解謎遊戲；每個 bug、效能瓶頸都是挑戰。 文件管理系統：建置多層次 Spring Boot 應用，整合完整後端功能；設計雙 PostgreSQL 資料來源與 HikariCP 連線池；透過複合索引與 N+1 查詢優化提升效能。 客戶專區問答系統：開發 FastAPI 基礎問答系統，整合 LangChain；實作多角色個性化 RAG 聊天機器人與混合檢索管道。 AI 工具，把 Debug 當成刻意成長。"
        },
        "extension": {
            "en": "Built document management system with multi-layered Spring Boot (@EnableRetry, @EnableCaching, @EnableRedisHttpSession, @EnableWebSecurity), dual PostgreSQL data sources with HikariCP, composite indexes and N+1 query optimization. Developed customer portal Q&A using FastAPI with LangChain, multi-character RAG chatbots, hybrid pgvector + pg_trgm retrieval. Configured DevOps portal with enterprise security (JWT, OAuth2, Keycloak SSO), Terraform OCI infrastructure. Led system modernization: JBoss to Spring Boot migration, Java 8→17 upgrade, Kubernetes deployment, RHEL 7→8 migration across 20+ servers.",
            "zh": "建置文件管理系統使用多層次 Spring Boot（@EnableRetry、@EnableCaching、@EnableRedisHttpSession、@EnableWebSecurity），雙 PostgreSQL 資料來源與 HikariCP，實作複合索引與 N+1 查詢優化。開發客戶專區問答系統使用 FastAPI 整合 LangChain，多角色 RAG 聊天機器人，混合 pgvector + pg_trgm 檢索。配置 DevOps 後台使用企業級安全（JWT、OAuth2、Keycloak SSO），Terraform OCI 基礎設施。主導系統現代化：JBoss 升級 Spring Boot，Java 8→17，Kubernetes 部署，RHEL 7→8 升級涵蓋 20+ 伺服器。"
        }
    },
    "quadrant2": {
        "title": {
            "en": "Foundations That Led Here",
            "zh": "前山伏筆"
        },
        "content": {
            "en": "EY Auditor: VBA macros revealed passion for redesigning processes. Far Eastern Bank Fintech PM (2021-2022): RPA automation showed me code's power to save hundreds of hours. From that moment, I knew engineering was my path. Tarobo Investment Macro Associate (2022-2023): Daily Python coding for trading strategies became more engaging than research. In small coding experiments, I felt passion turning logic into running systems. This contrast pushed me to career transition. Not because finance was bad, but because I wanted 'creation' rather than 'documentation'. Every successful debug proved my choice was right.",
            "zh": "EY 審計：VBA 巨集讓我發現熱衷於改造流程。\n\n遠東商銀 Fintech PM（2021-2022）：RPA 自動化展現程式碼節省百小時的威力，從那一刻我決定成為工程師。\n\nTarobo投資 Macro Associate（2022-2023）：每天寫 Python 處理交易策略，比研究報告更投入。\n\n在程式實驗中，我感受到將邏輯轉成系統的熱情。這種創造與記錄的差異推動我轉職。每個成功的 Debug 都證明我的選擇正確。"
        },
        "extension": {
            "en": "EY experience: automated reconciliations with VBA, built macros that reduced audit hours, optimized sampling logic, led cross-team checklists. Far Eastern Bank: RPA bot to handle 31 repetitive workflows, BNPL prototype with merchant settlement rules, built Power BI dashboards tracking KPIs, collaborated with telcos for digital wallets, mapped transaction events into auditable logs. Tarobo: integrated Shioaji for market tick data, designed automated backtest pipelines for volatility rebalancing, built Red-K trading logic, maintained multiple databases, automated ETL for cross-asset indicators, wrote daily emerging markets reports. Career transition: FreeCodeCamp JavaScript certification, iSpan JavaEE training, side experiments with Django apps, Jenkins setup, Docker deployments. Found passion in coding: turning logic into running systems. Chose creation over documentation. Toastmasters 8.5 years: structured abstract ideas into vivid stories, enhanced tech leadership skills. Journey from boredom in repetitive reports to joy in automation and model prototyping – every successful script affirmed engineering as vocation.",
            "zh": "EY 經歷：用 VBA 自動化核對，建巨集節省稽核工時，優化抽樣邏輯，主導跨組清單。遠東商銀：RPA 機器人自動化 31 項流程，做 BNPL 原型與商戶結算邏輯，建 Power BI KPI 儀表板，與電信合作開發數位錢包，交易事件映射成可稽核日誌。Tarobo：串接 Shioaji 市場逐筆資料，設計自動回測流程（波動率再平衡、紅K 策略），維護多個資料庫，自動化 ETL 產出跨資產訊號，每日撰寫新興市場報告。轉職路徑：FreeCodeCamp JS 證書、iSpan JavaEE 訓練，Side Project 嘗試 Django、Jenkins、Docker。發現程式熱情：能把腦中邏輯轉成系統，看到它自動運行。選擇創造而非記錄。Toastmasters 8.5 年：把抽象觀點轉成鮮明故事，溝通技巧加強技術領導。從重複財報的倦怠到程式自動化的快樂 – 每段程式碼都印證工程才是志業。"
        }
    },
    "quadrant3": {
        "title": {
            "en": "Battlefield",
            "zh": "實戰場"
        },
        "content": {
            "en": "Core: Spring Boot microservices, REST controllers, security filters. Django ASGI/ORM/REST. Celery async LLM retrieval. Docker/K8s for microservices. Redis distributed locks; RabbitMQ for async processing; PostgreSQL composite + GIN indexes, 5× retrieval boost. Algorithms: weekly LeetCode drills – Binary Trees, DP, Backtracking, Sliding Window.",
            "zh": "核心：Spring Boot 微服務、REST 控制器、安全過濾器。 Django ASGI/ORM/REST。 Celery 非同步 LLM 檢索。 Docker/K8s 微服務。 Redis 分布式鎖；RabbitMQ 非同步處理；PostgreSQL 複合+GIN 索引，檢索效能 5×。 演算法：每週 LeetCode 訓練 – 二元樹、DP、回溯、滑動視窗。"
        },
        "extension": {
            "en": "API Gateway: rewrote JOIN queries, added composite indexes, built caching layers. Retrieval systems: pg_trgm + pgvector hybrid, GIN + IVFFlat indexes, fallback logic to reduce hallucinations, provider rate-limiting. Infrastructure: containerized with Docker, K8s autoscaling, Terraform networking on OCI with VCN/Bastion/OKE. CI/CD: Jenkins pipelines. Reliability: Redis session management, WebSocket STOMP push, chain-of-responsibility for exceptions, JUnit5/Mockito coverage. Data: HikariCP tuning, ORM N+1 fix, batched queries reducing GC churn. Spring Boot: mastered layered architecture, Spring Security JWT filters, async @Scheduled tasks, optimized RestTemplate/WebClient. Algorithms: solved 200+ LeetCode problems focusing on production applications – Binary Trees for caching/indexing, DP for job scheduling, Backtracking for search optimizations.",
            "zh": "API Gateway：重寫 JOIN，加複合索引，建快取層。檢索系統：pg_trgm + pgvector 混合，GIN + IVFFlat 索引，fallback 策略降幻覺，API 呼叫限流。基礎設施：Docker 容器化，K8s 自動擴展，OCI Terraform 建 VCN/Bastion/OKE。CI/CD：Jenkins pipeline。可靠性：Redis 管理 session，WebSocket STOMP 推播，責任鏈處理例外，JUnit5/Mockito 測試覆蓋。資料：HikariCP 多資料源調優，修 ORM N+1，批次查詢降 GC。Spring Boot：熟練分層架構、Spring Security JWT 過濾器、非同步 @Scheduled 任務、RestTemplate/WebClient 優化。演算法：已解 200+ LeetCode 題目，專注生產應用 – 二元樹用於快取/索引，DP 用於任務排程，回溯用於搜尋優化。"
        }
    },
    "quadrant4": {
        "title": {
            "en": "Next Iteration",
            "zh": "下個迴圈"
        },
        "content": {
            "en": "Focus: high-concurrency architecture, asynchronous pipelines, distributed data systems, guided by DDIA. Product: build data-intensive flows that integrate AI modules, turn prototypes into user-facing MVPs. AI: generative models, prompt engineering, retrieval-augmented pipelines, embedding stores. Inspiration: Modular-style toolchains, assembling best-of-breed systems.",
            "zh": "核心關注：高併發架構、非阻塞非同步管線與分散式資料系統設計，實作過程以《Designing Data-Intensive Applications》為方法論依據。 產品：設計能整合 AI 模組的資料流，將原型轉化為用戶可用的 MVP。 AI：生成式模型、提示工程、RAG 管線、embedding 儲存。 借鏡：像 Modular 一樣組合最優工具鏈，打造最佳系統。"
        },
        "extension": {
            "en": "Forward roadmap: concurrency – refine Java CompletableFuture pools, explore Project Loom virtual threads, optimize non-blocking I/O with WebFlux and Netty; queues – benchmark RabbitMQ for throughput vs durability, backpressure handling, dead-letter strategies; database – incremental materialized views, sharding experiments, adaptive query caching; pipelines – batch embedding updates, retrieval accuracy tuning with hybrid pgvector + ANN, consistency checks across shards; AI – LLM-based doc routing, cost-aware tokenization, multi-provider orchestration, evaluation harness for accuracy/latency/cost tradeoffs; product – systematize side projects into MVPs, create feedback instrumentation, run A/B feature toggles, refine onboarding flows; team – knowledge base from Toastmasters, peer review rituals, ownership rotation. Guiding star: DDIA principles applied to AI systems – immutability, streaming-first, fault-tolerance, scalability, traceability – each new iteration strengthens data flow resilience while keeping product usable.",
            "zh": "前瞻路線：併發 – 精練 Java CompletableFuture 線程池，探索 Project Loom 虛擬線程，用 WebFlux/Netty 做非阻塞 I/O；佇列 – RabbitMQ 測試耐久與吞吐，設計 backpressure 機制與死信佇列；資料庫 – 增量物化檢視、分片實驗、自適應查詢快取；資料流 – 批次更新 embedding，混合 pgvector + ANN 提升檢索準確率，跨分片一致性檢查；AI – 文件路由、token 成本控制、多模型協作，建立準確率/延遲/成本評估框架；產品 – 把 side project 系統化成 MVP，內建回饋監測，執行 A/B 測試，優化 onboarding 流程；團隊 – 借助 Toastmasters 訓練形成知識庫，建立 PR review 儀式，模組輪值。 指北星：以《DDIA》原則導入 AI 系統 – 不可變性、串流優先、容錯、可擴展、可追蹤，每次迭代都讓資料流更韌性，同時保證產品可用。"
        }
    }
}